---
kind: property
id: P:Autodesk.Revit.UI.IFCExternalServiceUIData.SelectedIFCItem
source: html/d6a2a793-b596-420d-2533-c3001317990d.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.SelectedIFCItem Property

The selected IFC Item (can be IFC Entity, or PredefinedType)

## Syntax (C#)
```csharp
public string SelectedIFCItem { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null